{"idx2char": ["!", "\"", "$", "&", "'", "*", ",", "-", ".", "/", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9", ":", "<", ">", "?", "`", "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", "~", "·", "×", "à", "á", "è", "é", "ì", "í", "ò", "ó", "ù", "ú", "ü", "ā", "ē", "ě", "ī", "ń", "ō", "ū", "ǎ", "ǐ", "ǒ", "ǔ", "ǘ", "ǚ", "ǜ", "—", "‘", "’", "“", "”", "…", "∶", "─", "━", "□", "○", "、", "。", "〈", "〉", "《", "》", "「", "」", "『", "』", "【", "】", "ㄅ", "ㄆ", "ㄇ", "ㄈ", "！", "＂", "％", "＆", "＇", "（", "）", "＊", "＋", "，", "－", "．", "／", "０", "１", "２", "３", "４", "５", "６", "７", "８", "９", "：", "；", "＜", "＝", "＞", "？", "ａ", "ｂ", "ｃ", "ｄ", "ｅ", "ｆ", "ｇ", "ｈ", "ｉ", "ｊ", "ｋ", "ｌ", "ｍ", "ｎ", "ｏ", "ｐ", "ｑ", "ｒ", "ｓ", "ｔ", "ｕ", "ｖ", "ｗ", "ｘ", "ｙ", "ｚ", "～"], "char2idx": {"!": 0, "\"": 1, "$": 2, "&": 3, "'": 4, "*": 5, ",": 6, "-": 7, ".": 8, "/": 9, "0": 10, "1": 11, "2": 12, "3": 13, "4": 14, "5": 15, "6": 16, "7": 17, "8": 18, "9": 19, ":": 20, "<": 21, ">": 22, "?": 23, "`": 24, "a": 25, "b": 26, "c": 27, "d": 28, "e": 29, "f": 30, "g": 31, "h": 32, "i": 33, "j": 34, "k": 35, "l": 36, "m": 37, "n": 38, "o": 39, "p": 40, "q": 41, "r": 42, "s": 43, "t": 44, "u": 45, "v": 46, "w": 47, "x": 48, "y": 49, "z": 50, "~": 51, "·": 52, "×": 53, "à": 54, "á": 55, "è": 56, "é": 57, "ì": 58, "í": 59, "ò": 60, "ó": 61, "ù": 62, "ú": 63, "ü": 64, "ā": 65, "ē": 66, "ě": 67, "ī": 68, "ń": 69, "ō": 70, "ū": 71, "ǎ": 72, "ǐ": 73, "ǒ": 74, "ǔ": 75, "ǘ": 76, "ǚ": 77, "ǜ": 78, "—": 79, "‘": 80, "’": 81, "“": 82, "”": 83, "…": 84, "∶": 85, "─": 86, "━": 87, "□": 88, "○": 89, "、": 90, "。": 91, "〈": 92, "〉": 93, "《": 94, "》": 95, "「": 96, "」": 97, "『": 98, "』": 99, "【": 100, "】": 101, "ㄅ": 102, "ㄆ": 103, "ㄇ": 104, "ㄈ": 105, "！": 106, "＂": 107, "％": 108, "＆": 109, "＇": 110, "（": 111, "）": 112, "＊": 113, "＋": 114, "，": 115, "－": 116, "．": 117, "／": 118, "０": 119, "１": 120, "２": 121, "３": 122, "４": 123, "５": 124, "６": 125, "７": 126, "８": 127, "９": 128, "：": 129, "；": 130, "＜": 131, "＝": 132, "＞": 133, "？": 134, "ａ": 135, "ｂ": 136, "ｃ": 137, "ｄ": 138, "ｅ": 139, "ｆ": 140, "ｇ": 141, "ｈ": 142, "ｉ": 143, "ｊ": 144, "ｋ": 145, "ｌ": 146, "ｍ": 147, "ｎ": 148, "ｏ": 149, "ｐ": 150, "ｑ": 151, "ｒ": 152, "ｓ": 153, "ｔ": 154, "ｕ": 155, "ｖ": 156, "ｗ": 157, "ｘ": 158, "ｙ": 159, "ｚ": 160, "～": 161}}